Revit 2027 API
EnergyAnalysisWindowType.GetSolarHeatGainCoefficientsForSolarIndicientAngles Method
 Returns a map with solar heat gain coefficients (SHGC-values) for specific incident angles for the window type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<double, double> GetSolarHeatGainCoefficientsForSolarIndicientAngles()
Public Function GetSolarHeatGainCoefficientsForSolarIndicientAngles As IDictionary(Of Double, Double)
public:
IDictionary<double, double>^ GetSolarHeatGainCoefficientsForSolarIndicientAngles()
member GetSolarHeatGainCoefficientsForSolarIndicientAngles : unit -> IDictionary<float, float>
Return Value
IDictionary<Double, Double>
See Also
Reference
EnergyAnalysisWindowType Class
Autodesk.Revit.DB.Analysis Namespace